package Family_tree.View;

public interface ElementWorkInterface {
    String optionString = """
            Выбор действия:           
            \t 1. Добавить родича;
            \t 2. Удалить родича;
            \t 3. Зарегистрировать брак;
            \t 4. Расторгнуть брак;
            \t 5. Зарегистрировать ребёнка;
            \t 6. Найти родича;
            \t 7. Информация о родиче;            
            \t 8. Список родичей;
            \t 9. Список команд;
            \t q. Выход.
            """;
    
}
