/**
 * Как один из вариантов
 * Тут будут уже два человека
 * Надо будет создавать объект класса для указания связи между людьми
 * Т.е. человек1 и человек2 кем приходится друг другу - ЭТО СЛОЖНЫЙ ПУТЬ
 * Рекомендуется так не делать.
 * Рекомндации - добавление нового человека и все новые связи должны сразу сгенерироваться (папа, мама, брат и пр.)
 */
public class Communication {
    Human human1;
    Human human2;
    // + тип связи, для обозначения связи можно создать enum связи
    TypeCommunication communication; // связь с enum


}
