public class Main {
    public static void main(String[] args) {
        /**
         * сначала создать дерево
         * потом создать людей
         * добавить людей в семейное дерево
         * найти какого-то человека, вывести информацию по этому человеку - кто у него является родственниками и т.д.
         * основная работа в main
         * в классах FamilyTree & Human будет описание именной этих классов, то как они работают
         * минимальный объем - 4 человека (два родителя и два ребенка)
         * три класса - main & FamilyTree & Human
         * рекомендуется добавить метод для поиска братьев и сестер
         * для этого обратиться к родителю и узнать список его детей, исключив текущий объект, чтобы текущий объект не оказался братом самому себе
         * Нахождение бабушек, дедушек - надо у родителей посмотреть родителей и т.д.
         * поиск гендера - можно сделать enum class
         */
    }
}
