public class Parents {
    /**
     * дочерний клас Human (у всех родителей есть дети)
     * то тогда нужен еще класс - Ребенок
     * Описать, что у любого ребенка есть родитель
     * НО! в Java так нельзя сделать!!! (можно с костылями, но это не очень хорошо)
     * Необходимо иметь один объект для одного человека!!
     * Создали "Васю" - один объект, но Вася одновременно может быть и родителем и ребенком.
     * Вариант через наследование не пойдет.
     *
     * Рекоментации - у каждого человека есть родители (ссылку на другой какой-то объект) Что-то типа LinkedList
     *
     */
}
